app/controllers/prods_controller.rb

  def index
    @prods = Prod.all
---
SELECT `prods`.* FROM `prods`

  def show
    @prod = Prod.find(params[:id])
---
SELECT "prods".* FROM "prods" WHERE "prods"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @prod = Prod.find(params[:id])
---
SELECT "prods".* FROM "prods" WHERE "prods"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @prod = Prod.new(params[:prod])

    respond_to do |format|
      if @prod.save
---
INSERT INTO "prods" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 23 Jun 2013 22:48:10 UTC +00:00], ["name", ""], ["price", nil], ["updated_at", Sun, 23 Jun 2013 22:48:10 UTC +00:00]]

  def update
    @prod = Prod.find(params[:id])
---
SELECT "prods".* FROM "prods" WHERE "prods"."id" = ? LIMIT 1  [["id", "3"]]

  def destroy
    @prod = Prod.find(params[:id])
    @prod.destroy
---
SELECT "prods".* FROM "prods" WHERE "prods"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "prods" WHERE "prods"."id" = ?  [["id", 1]]